{
    "movies": [
      { "id": "1", "title": "Dune", "director": "Denis Villeneuve", "release": "October 22, 2021", 
        "synopsis": "In the distant future, Duke Leto Atreides is assigned by the Padishah Emperor Shaddam IV to replace Baron Vladimir Harkonnen as the fiefholder of Arrakis, a harsh desert planet and the sole source of 'spice', a valuable psychotropic substance that imparts heightened vitality and awareness. Spice is also key to interstellar travel, giving Spacing Guild Navigators the ability to guide starships to traverse space instantaneously and safely. Emperor Shaddam, fearful of Leto's rising power, plots for House Harkonnen to retake Arrakis, secretly aided by his Sardaukar troops, and destroy House Atreides. Leto is suspicious of the Emperor, but weighs the risks against the power of controlling Arrakis and making an alliance with its mysterious natives, the Fremen.",
        "timestamp": "09212024"},
      { "id": "2", "title": "Tenet", "director": "Christopher Nolan", "release": "August 26, 2020",
        "synopsis": "On 'the 14th', the Protagonist leads a covert CIA extraction during a staged terrorist siege at an Opera House in Kyiv. He is saved from KORD forces by a masked operative wearing a red trinket. The Protagonist retrieves an artifact but his team is captured and tortured. He swallows a suicide pill but wakes up to find it was a fake—a test that only he passed. He is recruited by 'Tenet', a secretive organization which briefs him on objects with 'inverted' entropy that move backward through time. With his handler Neil, he traces inverted munitions to Priya Singh, an arms dealer in Mumbai.",
        "timestamp": "09212024"},
      { "id": "3", "title": "The Place Beyond the Pines", "director": "Derek Cianfrance", "release": "October 22, 2021",
        "synopsis": "In 1997, Luke Glanton is a motorcycle stuntman with a traveling carnival. In Schenectady, he meets his ex-lover Romina Gutierrez, who is now with another man, Kofi Kancam. Luke discovers that he unknowingly fathered Romina's baby Jason the previous year. He leaves the carnival to stay near mother and son.",
          "timestamp": "09212024"},
      { "id": "4", "title": "Ad Astra", "director": "James Gray", "release": "September 20, 2019",
        "synopsis": "In the early 22nd century, a mysterious power surge originating in space wreaks havoc throughout the world, causing tens of thousands of casualties. Major Roy McBride of SpaceCom, a veteran astronaut, is informed by his superiors that the surge may have come from the vicinity of Neptune, where the 'Lima Project', a space station, was sent twenty-nine years ago to scan the galaxy for traces of intelligent life. Roy's father, H. Clifford McBride, was the project's leader. The Lima Project ceased contact with earth many years earlier and the fate of its crew is unknown. Roy agrees to travel to Mars in an effort to send a message to the Lima Project to determine whether his father is still alive and the danger of additional power surges can be forestalled.",
        "timestamp": "09212024"},
      { "id": "5", "title": "Blade Runner", "director": "Ridley Scott", "release": "June 25, 1982",
        "synopsis": "In 2019 Los Angeles, former police officer Rick Deckard is detained by Officer Gaff, who likes to make origami figures, and is brought to his former supervisor, Bryant. Deckard, whose job as a 'blade runner' was to track down bioengineered humanoids known as replicants and terminally 'retire' them, is informed that four replicants are on Earth illegally. Deckard begins to leave, but Bryant ambiguously threatens him and Deckard stays. The two watch a video of a blade runner named Holden administering the Voight-Kampff test, which is designed to distinguish replicants from humans based on their emotional responses to questions. The test subject, Leon, shoots Holden on the second question. Bryant wants Deckard to retire Leon and three other Nexus-6 replicants: Roy Batty, Zhora, and Pris.",
        "timestamp": "09212024"},
      { "id": "6", "title": "Arrival", "director": "Denis Villeneuve", "release": "September 2, 2016",
        "synopsis": "Linguist Louise Banks's daughter Hannah dies at the age of twelve from an incurable illness.Twelve extraterrestrial spacecraft hover over various locations around the Earth. In the ensuing widespread panic, affected nations send military and scientific experts to monitor and study them. In the United States, US Army Colonel Weber recruits Banks and physicist Ian Donnelly to study the craft above Montana. On board, Banks and Donnelly make contact with two cephalopod-like, seven-limbed aliens, whom they call 'heptapods'; Donnelly nicknames them Abbott and Costello. Banks and Donnelly research the complex written language of the heptapods, consisting of palindromic phrases written with circular symbols, and share the results with other nations.",
        "timestamp": "09212024"}
    ]
}